export const jobsData = [
    {
        id: 1,
        title: '3D Artist',
        role: 'Role and Responsibilities',
        responsibilities: [
            'ร่วมสร้างสรรค์โมเดล 3 มิติและสิ่งพิมพ์ (Textures) สำหรับภาพยนตร์และองค์ประกอบเกม (Props) ให้สอดคล้องกับทิศทางของเกม',
            'ใช้โปรแกรม Blender และ Maya เพื่อพัฒนาสินทรัพย์บุคคลที่สูงมากสำหรับบำบัดใน Unreal Engine 5'
        ],
        qualifications: 'Qualifications',
        qualificationsList: [
            'มีประสบการณ์ในการใช้งานโปรแกรมสร้างโมเดล 3 มิติ โดยเฉพาะ Blender หรือ Maya',
            'มี Portfolio ที่แสดงให้เห็นถึงทักษะด้านงานศิลป์ 3 มิติ (การปั้นโมเดล, การทำพื้นผิว, และความเข้าใจในด้านบรรยากาศ)',
            'มีความหลงใหลในเกมแนวสยองขวัญและการเล่าเรื่องผ่านสภาพแวดล้อม',
            'สามารถทำงานร่วมกับผู้อื่นในทีมสร้างสรรค์ได้อย่างมีประสิทธิภาพ'
        ]
    },
    {
        id: 2,
        title: '3D Animator',
        role: 'Role and Responsibilities',
        responsibilities: [
            'สร้างแอนิเมชั่นและแสดงผลของตัวบุคคลในเชิงนับถือและส่งเสริมองค์ประกอบการเล่นเกมและความรู้สึก',
            'ทำงานร่วมกับทีมเพื่อเพิ่มสร้างสรรค์สิ่งที่สอดคล้องกับเกมที่สอดคล้องกับเกมที่เกมเพลย์และเสนอ',
            'นำเสนอเอนิเมชั่นใน Unreal Engine 5'
        ],
        qualifications: 'Qualifications',
        qualificationsList: [
            'มีความเข้าใจในการใช้โปรแกรม Maya หรือ Blender สำหรับการทำงานในเชิงนับถือตัวตัว',
            'มีความเข้าใจในหลักการแอนิเมชั่นและองค์ประกอบเชิงนับถือ (Animation Principles) และการทำให้การเคลื่อนไหวถูกต้องและน่าเชื่อถือ',
            'มีความเข้าใจในการเรียบร้อยเกี่ยวกับการ Rigging และการทำ Optimization สำหรับงานเกม',
            'มี Portfolio ที่แสดงให้เห็นถึงทักษะด้าน 3D Animation'
        ]
    },
    {
        id: 3,
        title: 'Programmer',
        role: 'Role and Responsibilities',
        responsibilities: [
            'ช่วยพัฒนาระบบต่าง ๆ ภายใน Character, Interact, Puzzle บน Unreal Engine 5',
            'มีส่วนร่วมในการเขียนโปรแกรม AI (AI Perception) ที่ทำงานร่วมกับตัวละครหลัก',
            'เขียนและแก้ไขโค้ดทาง Blueprint, C++'
        ],
        qualifications: 'Qualifications',
        qualificationsList: [
            'มีประสบการณ์ใช้งาน Blueprint หรือ C++ และต้องมีทักษะการพัฒนาเกมบน Unreal Engine',
            'มีความเข้าใจในหลักการและระบบการพัฒนาเกมในระดับกลางและระดับสูงในการเล่นเกม',
            'มี Portfolio หรือตัวอย่างโค้ดที่แสดงให้เห็นถึงความสามารถการเขียนโปรแกรมเกม',
            'มีทักษะการวิเคราะห์และแก้ไขปัญหาได้เป็นอย่างดี Critical Thinking และมีความเข้าใจในการสร้างระบบที่มีประสิทธิภาพและองค์สอดสอดได้ดี'
        ]
    },
    {
        id: 4,
        title: 'Game Designer',
        role: 'Role and Responsibilities',
        responsibilities: [
            'ออกแบบ และจัดทำเอกสารกลไกเกมเพลย์ (Gameplay Mechanics), ปริศนา, และระบบต่างๆ ของเกม',
            'ดูแล และปรับปรุงเอกสาร Game Design Document (GDD) ให้เป็นปัจจุบันอยู่เสมอ',
            'ทำงานร่วมกับ Level Designer, 3D Artist และ Programmer เพื่อให้มั่นใจว่าทุกองค์ประกอบของเกมทำงานสอดคล้องกัน',
            'วิเคราะห์และปรับปรุงสมดุลของเกมเพื่อสร้างประสบการณ์การเล่นและน่าตื่นเต้นสำหรับผู้เล่น'
        ],
        qualifications: 'Qualifications',
        qualificationsList: [
            'มีทักษะในการส่งสารและการจัดทำเอกสาร Game Design ที่ชัดเจนและเป็นระบบ',
            'มีความเข้าใจในจิตวิทยาของผู้เล่นและความสามารถในการออกแบบประสบการณ์ที่มีประสิทธิภาพและความรู้สึก',
            'มีความคิดเชิงวิเคราะห์และสามารถแก้ไขปัญหาเชิงเทียบเชื่อมได้',
            'มี Portfolio ที่แสดงถึงทักษะการออกแบบเกม, การเขียน GDD, หรือโปรเจกต์ที่แสดงให้เห็นถึงความสามารถการออกแบบเกม'
        ]
    }
];
